プリエンプテぃぶ　実行中のプロセスを無理やり実行可能状態が実行状態奪う事

ノンプリエンプティぶ　プリエンプティ部ができない事

ディスパッチャ、実行可能状態の奴を実行状態にする（ディスパッチ）

ページング　仮想メモリをページ単位で管理し、主記憶の領域確保

ページフォールト　主記憶に実行時に必要なページない事

ページイン（主記憶メイン)仮想メモリから主記憶へページ入れる

ページアウト主記憶から仮想メモリに移す

ページリプレースメント　ページイン、ページアウトの事

デマンドページングページフォールト発生時、ページインする

プリ(previous:前に)ページング　ページフォールト前に、ページインしておく

スラッシング　プログラムの多重度が増加し、ページ置き換えが多くなり、処理効率下がること

LFU　最も参照回数少ないもの置換　LRU 最も長い間参照してないもの

API　外部にソフトウェア一部公開し利用できるようにする。APからOSの機能利用

WebAPI インターネットを通じて外部に公開されているシステム使う

Java Beans Java言語で作られたコンポーネントでAP開発。コンポーネント再利用可

ActiveX IEで動的コンテンツなどの動画を再生するための技術

CORBA オブジェクトの国際標準仕様。オブジェクト同士がメッセージを交換できる